RU/Files/day_2_Ext/ShapeOptCases/run/optimisation/wedgeForce/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0015;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0015;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0015;
        value           uniform 0.0015;
    }
    bottom
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.0015;
    }
    top
    {
        type            zeroGradient;
    }
    bottomBody
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.0015;
    }
    topBody
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.0015;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
