RU/Files/day_2_Ext/ShapeOptCases/run/optimisation/wedgeForce/system/rbfMotionDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          rbfMotionDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

movingPatches
(
    topBody
    bottomBody

    bottom
);

controlPoints
(
    // Moving points

    // Back plane
    ( 0   0.25 -1)
    ( 0.5 0.75 -1)
    ( 1   1.25 -1)
    ( 1.5 1.75 -1)
    // Front plane
    ( 0   0.25  1)
    ( 0.5 0.75  1)
    ( 1   1.25  1)
    ( 1.5 1.75  1)

    // Box points

    // Back plane
    (-1 0.125 -1)
    ( 1 0.125 -1)
    ( 3 0.125 -1)
    ( 5 0.125 -1)
    //
    (-1 3 -1)
    ( 1 3 -1)
    ( 3 3 -1)
    ( 5 3 -1)
    // Front plane
    (-1 0.125  1)
    ( 1 0.125  1)
    ( 3 0.125  1)
    ( 5 0.125  1)
    //
    (-1 3  1)
    ( 1 3  1)
    ( 3 3  1)
    ( 5 3  1)
);


motionBounds
(
    // Moving points

    // Back plane
    (( 0.45 0 0) ( -0.45 0 0))
    (( 0.25  0 0) ( -0.25  0 0))
    (( 0.25  0 0) ( -0.25  0 0))
    (( 0.25 0 0) ( -0.25 0 0))
    // Front plane
    (( 0.45 0 0) ( -0.45 0 0))
    (( 0.25  0 0) ( -0.25  0 0))
    (( 0.25  0 0) ( -0.25  0 0))
    (( 0.25 0 0) ( -0.25 0 0))


    // Box points

    // Back plane
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    //
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))

    // Front plane
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    //
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
);

nSteps 5;

interpolation
{
    RBF  IMQB;

    focalPoint (0.5 1 0);
    innerRadius 2;
    outerRadius 5;
    polynomials off;

    W2Coeffs
    {
        radius     1.0;
    }
    TPSCoeffs
    {
        radius     5.0;
    }
    GaussCoeffs
    {
        radius        0.1;
    }
    IMQBCoeffs
    {
        radius       0.5;
    }
}


// ************************************************************************* //
